Update .gitignore, remove markdown, update docs
Added .env to .gitignore for better security.  Updated README.md and package.json with minor changes.
